# %%
import requests
import random

nocache = random.randint(0, 1000000) + 174347281126
# 嘗試找出 API 真正的網址
url = "https://pda5284.gov.taipei/MQS/RouteDyna?routeid=10417&nocache=" + str(nocache)
response = requests.get(url)
data = response.json()
data = dict(data)
data = data["Stop"]


# %%
stations_map = {
    36021: "蘆洲總站",
    36022: "王爺廟口",
    36023: "空中大學(中正路)",
    36024: "中原公寓",
    36025: "蘆洲國小",
    36026: "蘆洲監理站",
    36027: "蘆洲派出所",
    36028: "溪墘",
    36029: "捷運徐匯中學站",
    36030: "徐匯中學",
    36031: "幸福市場",
    36032: "建和新村",
    129828: "捷運三和國中站",
    36033: "三和國中",
    36034: "格致中學(三和路)",
    36036: "厚德派出所",
    36038: "德林寺(三和路)",
    36039: "龍門路口",
    36040: "三安里",
    36041: "長壽西街口",
    36042: "長元西街口",
    36043: "正義重新路口",
    36044: "天台廣場",
    36045: "大同路口",
    36046: "中山藝術公園",
    218023: "捷運菜寮站",
    36047: "過圳街",
    36048: "三重區公所(過圳街)",
    36049: "三重稅捐分處",
    36050: "菜寮(重陽路)",
    36051: "集美國小",
    36052: "三重國民運動中心",
    36053: "三重中學",
    36054: "重安街口",
    36055: "臺北車站(忠孝)",
    36056: "捷運善導寺站",
    36057: "華山文創園區",
    36058: "忠孝國小",
    36059: "臺北科技大學(忠孝)",
    36060: "正義郵局",
    36061: "懷生國中",
    36063: "頂好市場",
    36064: "捷運忠孝敦化站",
    36065: "阿波羅大廈",
    36066: "交通部觀光署",
    36067: "捷運國父紀念館站(忠孝)",
    36068: "聯合報",
    36069: "捷運市政府站",
    36070: "市立工農",
    36071: "捷運永春站(忠孝)",
    36072: "捷運永春站(松山)",
    36073: "雙永國小",
    36074: "永吉松山路口",
    36075: "松山車站(松山)",
    36077: "虎林街口",
    36078: "永吉國中",
    36079: "松隆路口",
    36080: "松山高中(松隆)",
    36081: "聯合報",
    36082: "捷運國父紀念館站(忠孝)",
    36083: "交通部觀光署",
    36084: "阿波羅大廈",
    36085: "捷運忠孝敦化站",
    36086: "頂好市場",
    36087: "捷運忠孝復興站",
    36088: "正義郵局",
    36089: "臺北科技大學(忠孝)",
    36090: "忠孝國小",
    36091: "華山文創園區",
    36092: "捷運善導寺站",
    36093: "臺北車站(忠孝)",
    36094: "重安街口",
    36095: "三重中學",
    36096: "三重國民運動中心",
    36097: "集美國小",
    36098: "菜寮(重新路)",
    36099: "捷運菜寮站",
    56960: "中山藝術公園",
    36100: "大同路口",
    36101: "正義重新路口",
    36102: "長元西街口",
    36103: "長壽西街口",
    36104: "三安里",
    36105: "龍門路口",
    36106: "德林寺(三和路)",
    36108: "厚德派出所",
    36109: "格致中學(三和路)",
    36110: "三和國中",
    129829: "捷運三和國中站",
    36111: "建和新村",
    36112: "幸福市場",
    36113: "捷運徐匯中學站",
    36114: "民和公寓",
    36115: "溪墘",
    36116: "蘆洲派出所",
    36117: "蘆洲監理站(中正路)",
    36118: "蘆洲國小",
    36119: "中原公寓",
    36120: "空中大學(中正路)",
    36121: "王爺廟口",
    36122: "蘆洲總站",
}

stations_map_rev = {v: k for k, v in stations_map.items()}

result = {}

for station in data:
    station = dict(station)
    station_id = station["id"]
    station_name = stations_map[station_id]

    n1 = station["n1"]
    n1 = n1.split(",")

    print(f"{station_name} ({station_id})")
    print(f"  {float(n1[7])/60}分鐘到達")
    result[station_name] = float(n1[7]) / 60

while True:
    station_name = input("請輸入站名(直接按enter離開):")
    if station_name == "":
        break
    if station_name in result:
        print(f"{station_name} ({stations_map_rev[station_name]})")
        print(f"  {result[station_name]}分鐘到達")
    else:
        print("查無此站")